manuals/core-utils.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-02-02 Tue 08:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Core Utilities Cheat Sheet</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Joshua Branson" />
</head>
<body>
<div id="content">
<h1 class="title">Core Utilities Cheat Sheet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. find</a></li>
<li><a href="#orgheadline5">2. permissions</a>
<ul>
<li><a href="#orgheadline2">2.1. chmod</a></li>
<li><a href="#orgheadline3">2.2. chown</a></li>
<li><a href="#orgheadline4">2.3. chgrp</a></li>
</ul>
</li>
<li><a href="#orgheadline6">3. How I got my local apache server working again:</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> find</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><p>
find and report all php files in the specified dir current directory
</p>
<div class="org-src-container">

<pre class="src src-sh">find . -name <span style="color: #CC9393;">'.*php'</span> -print
</pre>
</div>

<p>
To find all of the specified files in all of the subdirectories starting with dir
</p>
<div class="org-src-container">

<pre class="src src-sh">find . -name <span style="color: #CC9393;">\*</span>.php -print
</pre>
</div>

<p>
To find all of the selected files (including sub-directories) and then delete them
</p></li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">find . -name <span style="color: #CC9393;">\*</span>.pdf -exec /bin/rm {} <span style="color: #CC9393;">\;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">2</span> permissions</h2>
<div class="outline-text-2" id="text-2">
<p>
In Unix everything is a file.  When you write a text document called "text.text", that is a Unix file.  When you create a directory (Windows users call this a folder) called "Music",  you also are creating a Unix file.  Obviously, "text.text" and "Music" behave very differently.  One has your favorite songs, and the other is a text document, BUT the linux kernel assumes that they are both Unix files.  All unix files have read, write, and execute permissions specific to each unix file.  This typiccally means that the ordinary user joshua cannot read, write, or execute anything in the <code>/root/</code> folder.
</p>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> chmod</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Change a file's modifications.  This specifies if what user, group, and if everyone else can read, write, or execute the file.
</p>

<p>
Permissions can modify the permissions of the user's, the group's and all others.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> chown</h3>
<div class="outline-text-3" id="text-2-2">
<p>
chown [-R] &lt;owner&gt; [file | directory]
</p>


<p>
Change the file's owner.  The file's owner is typically root or an ordinary user.
</p>

<p>
Examples include
</p>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.3</span> chgrp</h3>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">3</span> How I got my local apache server working again:</h2>
<div class="outline-text-2" id="text-3">
<p>
For some reason, my ~/ folder had permissions <code>drwxrws---</code>
</p>

<p>
To fix it I did
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #DCDCCC; font-weight: bold;">cd</span> /home/; chmod g-s joshua; ls -lh | grep joshua
</pre>
</div>

<pre class="example">
drwxrwx--- 83 joshua http 4.0K Feb  2 08:04 joshua
</pre>

<p>
The s was magically replaced with a x
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Joshua Branson</p>
<p class="date">Created: 2016-02-02 Tue 08:48</p>
<p class="validation"></p>
</div>
</body>
</html>
